#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьПоУмолчанию(Команда)
	ЗаполнитьПоУмолчаниюНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Процедура ЗаполнитьПоУмолчаниюНаСервере()

	МассивДанных = Новый Массив();

	МассивДанных.Добавить(
		Новый Структура("ТипГрузовогоМеста, УслугаСортировки, Стоимость", "МГТ",
		Перечисления.УслугаСортировки.Обработка, 10));
	МассивДанных.Добавить(
		Новый Структура("ТипГрузовогоМеста, УслугаСортировки, Стоимость", "Шины",
		Перечисления.УслугаСортировки.Обработка, 50));
	МассивДанных.Добавить(
		Новый Структура("ТипГрузовогоМеста, УслугаСортировки, Стоимость", "КГТ",
		Перечисления.УслугаСортировки.Обработка, 100));
		
	МассивДанных.Добавить(	
		Новый Структура("ТипГрузовогоМеста, УслугаСортировки, Стоимость", "МГТ",
		Перечисления.УслугаСортировки.Хранение, 10));
	МассивДанных.Добавить(
		Новый Структура("ТипГрузовогоМеста, УслугаСортировки, Стоимость", "Шины",
		Перечисления.УслугаСортировки.Хранение, 10));
	МассивДанных.Добавить(
		Новый Структура("ТипГрузовогоМеста, УслугаСортировки, Стоимость", "КГТ",
		Перечисления.УслугаСортировки.Хранение, 10));
	МассивДанных.Добавить(
		Новый Структура("ТипГрузовогоМеста, УслугаСортировки, Стоимость", "Хаб",
		Перечисления.УслугаСортировки.Хранение, 10));

	ДатаЗаписи = Дата(2022, 08, 01);
			
	Для Каждого эл Из МассивДанных Цикл
		рег = РегистрыСведений.ТарифыУслугСортировки.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(рег, эл);
		рег.Период = ДатаЗаписи;
		рег.Записать(); 
	КонецЦикла;

КонецПроцедуры

#КонецОбласти