
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьПоУмолчанию(Команда)
	ЗаполнитьПоУмолчаниюНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//@skip-check module-unused-method
&НаСервереБезКонтекста
Процедура ЗаполнитьПоУмолчаниюНаСервере()
	
	ЗначенияЗаполнения = Новый Массив();
	ЗначенияЗаполнения.Добавить("Хаб");
	ЗначенияЗаполнения.Добавить("МГТ");
	ЗначенияЗаполнения.Добавить("КГТ");
	ЗначенияЗаполнения.Добавить("Шины");
	
	Для Каждого эл Из ЗначенияЗаполнения Цикл
		
		спрТГМ = Справочники.ТипыГрузовыхМест.СоздатьЭлемент();
		спрТГМ.Наименование = эл;
		спрТГМ.Код = эл;
		
		Попытка
			спрТГМ.Записать();
		Исключение
			СообщениеПользователю = Новый СообщениеПользователю();
			СообщениеПользователю.Текст = ОписаниеОшибки();
			СообщениеПользователю.Сообщить();			 						
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти