
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.СтатусЗагрузкиДанных = Перечисления.СтатусЗагрузкиДанных.НетДанных;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Асинх Процедура ВыборФайла(Команда)
	
	ДиалогОткрытия = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);

	ДиалогОткрытия.МножественныйВыбор = Ложь;
	
	ДиалогОткрытия.ПроверятьСуществованиеФайла = Истина;
	
	ДиалогОткрытия.Расширение = ".csv";
	
	Результат = Ждать ДиалогОткрытия.ВыбратьАсинх();
	
	Если ЗначениеЗаполнено(Результат[0]) Тогда
		ИмяФайлаЗагрузки = Результат[0];
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьФайл(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Сохраните документ";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	
	
КонецПроцедуры

#КонецОбласти
