// @strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// Прочитать файл данных.
// 
// Параметры:
//  Документ - ДокументСсылка.ЗагрузкаДанных - Документ
//  ИмяФайла -Строка  - Имя файла
//
Процедура ПрочитатьФайлДанных(Документ, ИмяФайла) Экспорт
	
	Поток = Новый ФайловыйПоток(ИмяФайла, РежимОткрытияФайла.Открыть, ДоступКФайлу.Чтение);
	
	Чтение = Новый ЧтениеТекста(Поток);
	
	Чтение.ПрочитатьСтроку();
	
	Строка = Чтение.ПрочитатьСтроку();		
	
	ВремяНачала = ТекущаяУниверсальнаяДатаВМиллисекундах();	
	
	Пока Строка <> Неопределено Цикл
		
		Поля = СтрРазделить(Строка, ",", Истина);
		
						
		
		Строка = Чтение.ПрочитатьСтроку();
		
	КонецЦикла;
	
	Сообщить("Время чтения:" + Строка(ТекущаяУниверсальнаяДатаВМиллисекундах() - ВремяНачала));
	
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли