
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Заполнить2022(Команда)
	Заполнить2022НаСервере()
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Процедура Заполнить2022НаСервере()
	
	Календарь = Константы.ОсновнойКалендарь.Получить();
	Если НЕ ЗначениеЗаполнено(Календарь) Тогда
		Календарь = Справочники.Календари.СоздатьЭлемент();
		Календарь.Наименование = "Основной 2022";
		Календарь.Записать();
		
		Константы.ОсновнойКалендарь.Установить(Календарь.Ссылка);
	КонецЕсли;
	
	ТекДата = Дата(2022, 01, 01);
	
	Для сч = 1 по 365 Цикл
		регКалендарь = РегистрыСведений.КалендарныеГрафики.СоздатьМенеджерЗаписи();
		регКалендарь.Календарь = Календарь;
		регКалендарь.Год = Год(ТекДата);
		регКалендарь.ДатаГрафика = ТекДата;
		регКалендарь.ДеньВключенВГрафик = ДеньНедели(ТекДата) < 6;
		регКалендарь.КоличествоДнейВГрафикеСНачалаГода = сч;
		регКалендарь.Записать(Истина);
		
		ТекДата = ТекДата + 86400;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти